rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: LicenseRef-Realtek-5-Clause
 */

/*============================================================================*
 *                              Header Files
 *============================================================================*/

#include <string.h>
#include <bt_types.h>
#include "trace.h"
#include "app_main.h"
#include "app_cmd.h"
#include "ota_service.h"
#include "app_mmi.h"
#include "app_cfg.h"
#include "app_cfg_nv.h"
#include "app_timer.h"
#include "app_ota.h"
#include "rtl876x.h"
#include "fmc_api.h"
#include "app_bt_policy_api.h"
#include "gap_conn_le.h"
#include "app_ble_cfg.h"
#include "app_ble_gap.h"
#include "app_report.h"

#include "stdlib.h"
#include "app_sniff_mode_cs.h"
#include "ota_ext.h"
#include "wdg.h"
#include "cache.h"
#include "bt_bond_le.h"
#include "gap_storage_le.h"
#include "gatt_builtin_services.h"
#include "ftl.h"
#include "flash_map.h"
#include "aon_wdg_ext.h"

#define COPY_WDG_KICK_SIZE  0xF000
#define ACTIVE_BANK         0
#define WDG_TIMEOUT_TIME_MS 64000

/** @defgroup  APP_OTA_SERVICE APP OTA handle
    * @brief APP OTA Service to implement OTA feature
    * @{
    */

/*============================================================================*
 *                              Variables
 *============================================================================*/
/** @defgroup APP_OTA_Exported_Variables APP OTA Exported Variables
    * @brief
    * @{
    */
/** @brief  OTA timer event*/
typedef enum
{
    APP_TIMER_OTA_RESET,
    APP_TIMER_OTA_TRANSFER,
    APP_TIMER_OTA_RWS_SYNC,
} T_OTA_TIMER;

typedef struct
{
    bool do_srv_change;
    uint8_t remote_addr[6];
} T_OTA_SRV_CHANGE_INFO;

static T_APP_OTA_DB ota_struct;
static uint8_t timer_idx_ota_reset = 0;
static uint8_t timer_idx_ota_transfer = 0;
static uint8_t timer_idx_ota_rws_sync = 0;
static uint8_t ota_timer_id = 0;

extern bool le_get_conn_local_addr(uint16_t conn_handle, uint8_t *bd_addr, uint8_t *bd_type);
/** End of APP_OTA_Exported_Variables
    * @}
    */

/*============================================================================*
 *                              Private Functions
 *============================================================================*/
/** @defgroup APP_OTA_Exported_Functions APP OTA service Exported Functions
    * @brief
    * @{
    */

void app_ota_disc_b2s_profile(void)
{
    for (uint8_t i = 0; i < MAX_BR_LINK_NUM; i++)
    {
        if (app_link_check_b2s_link_by_id(i))
        {
            app_bt_policy_disconnect(app_db.br_link[i].bd_addr, ALL_PROFILE_MASK);
        }
    }
}

/**
    * @brief  Reset local variables
    * @return void
    */
static void app_ota_clear_local(uint8_t cause)
{
    APP_PRINT_TRACE1("app_ota_clear_local cause: %d", cause);

    app_sniff_mode_b2s_enable(ota_struct.bd_addr, SNIFF_DISABLE_MASK_OTA);

#if FORCE_OTA_TEMP
    if (ota_struct.force_temp_mode)
    {
        force_enable_ota_temp(false);
    }
#endif

    if (ota_struct.p_ota_temp_buf_head != NULL)
    {
        free(ota_struct.p_ota_temp_buf_head);
    }

    if (ota_struct.bp_level)
    {
        fmc_flash_nor_set_bp_lv(flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0),
                                ota_struct.bp_level);
    }
    memset(&ota_struct, 0, offsetof(T_APP_OTA_DB, test));
}

/**
    * @brief  check ota mode
    * @return bud status
    */
static uint8_t app_ota_check_ota_mode(void)
{
    uint8_t ret;

    if (app_cfg_const.bud_role == REMOTE_SESSION_ROLE_SINGLE)
    {
        ret = SINGLE_DEFAULT;
    }
    else
    {
        ret = SINGLE_B2B_DISC;
    }

    APP_PRINT_TRACE1("app_ota_check_ota_mode: %d", ret);

    return ret;
}

/**
    * @brief    send meessage between two buds whe rws ota
    * @param    ota_mode    ble ota or spp ota
    * @param    cmd_id  command id
    * @param    data    message data
    * @return   void
    */
#if 0
static void app_ota_rws_send_msg(uint8_t ota_mode, uint8_t cmd_id, uint8_t data)
{

}
#endif

/**
    * @brief    erase the ota header of inactive bank
    * @param    void
    * @return   void
    */
static void app_ota_erase_ota_header(void)
{
    if (ota_struct.test.t_stress_test)
    {
        ota_struct.test.t_stress_test = 0;
        if (is_ota_support_bank_switch())
        {
            fmc_flash_nor_set_bp_lv(flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0), 0);
            uint32_t header_addr = get_active_ota_bank_addr();
            fmc_flash_nor_erase(header_addr, FMC_FLASH_NOR_ERASE_SECTOR);
        }
    }
}

/**
    * @brief  get encrypt setting
    * @param  void
    * @return true:aes encrypt enable; false: aes encrypt disable
    */
static bool app_ota_enc_setting(void)
{
    return ota_struct.test.t_aes_en;
}

/**
    * @brief  timeout callback for ota
    * @param  timer_evt  timer event
    * @param  param
    * @return void
    */
static void app_ota_timeout_cb(uint8_t timer_evt, uint16_t param)
{
    APP_PRINT_TRACE1("app_ota_timeout_cb: timer id 0x%02X", timer_evt);

    switch (timer_evt)
    {
    case APP_TIMER_OTA_RESET:
        {
            app_stop_timer(&timer_idx_ota_reset);
            app_ota_erase_ota_header();
            chip_reset(RESET_ALL);
        }
        break;
    case APP_TIMER_OTA_TRANSFER:
        {
            app_stop_timer(&timer_idx_ota_transfer);
            app_ota_error_clear_local(OTA_IMAGE_TRANS_TIMEOUT);
        }
        break;
    default:
        break;
    }
}

/**
    * @brief    get current active bank
    * @param    void
    * @return   0x01:bank0, 0x02:bank1, 0x03:not support bank switch
    */
uint8_t app_ota_get_active_bank(void)
{
    uint8_t active_bank;
    uint32_t ota_bank0_addr;

    if (is_ota_support_bank_switch())
    {
        ota_bank0_addr = flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0);

        if (ota_bank0_addr == get_active_ota_bank_addr())
        {
            active_bank = IMAGE_LOCATION_BANK0;
        }
        else
        {
            active_bank = IMAGE_LOCATION_BANK1;
        }
    }
    else
    {
        active_bank = NOT_SUPPORT_BANK_SWITCH;
    }

