rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
    return active_bank;
}

/**
    * @brief    execute ota enter callback
    * @param    void
    * @return   void
    */
static void app_ota_enter(void)
{
    T_OTACbQueueElem *p_item;
    p_item = (T_OTACbQueueElem *)ota_struct.cback_list[OTA_ENTER].p_first;
    while (p_item != NULL)
    {
        OTAEnterCbFunc p_cback = (OTAEnterCbFunc)p_item->cback;
        p_cback();
        p_item = p_item->p_next;
    }
}

/**
    * @brief    execute ota exit callback
    * @param    void
    * @return   void
    */
static void app_ota_exit(void)
{
    T_OTACbQueueElem *p_item;
    p_item = (T_OTACbQueueElem *)ota_struct.cback_list[OTA_EXIT].p_first;
    while (p_item != NULL)
    {
        OTAExitCbFunc p_cback = (OTAExitCbFunc)p_item->cback;
        p_cback();
        p_item = p_item->p_next;
    }
}


/**
    * @brief    Handle the start dfu control point
    * @param    p_data     data to be written
    * @return   handle result 0x01:success other:fail
    */
static uint8_t app_ota_start_dfu_handle(uint8_t *p_data)
{
    uint8_t results = DFU_ARV_SUCCESS;

    if (p_data == NULL)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

    if (app_ota_enc_setting())
    {
        aes256_decrypt_16byte(p_data);
    }

    T_IMG_CTRL_HEADER_FORMAT *start_dfu_para = (T_IMG_CTRL_HEADER_FORMAT *)p_data;

#if FORCE_OTA_TEMP
    ota_struct.force_temp_mode = *(uint8_t *)((T_IMG_CTRL_HEADER_FORMAT *)p_data + 1);
#endif

    ota_struct.image_total_length = start_dfu_para->payload_len + DEFAULT_HEADER_SIZE;
    ota_struct.image_id = start_dfu_para->image_id;
    APP_PRINT_TRACE5("app_ota_start_dfu: ic_type=0x%x, CtrlFlag=0x%x, img_id=0x%x ,CRC16=0x%x, Length=0x%x",
                     start_dfu_para->ic_type,
                     start_dfu_para->ctrl_flag,
                     start_dfu_para->image_id,
                     start_dfu_para->crc16,
                     ota_struct.image_total_length
                    );

    if (app_ota_check_section_size(ota_struct.image_total_length, ota_struct.image_id) == false)
    {
        APP_PRINT_ERROR0("app_ota_check_section_size: Image is oversize");
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

#if FORCE_OTA_TEMP
    if (ota_struct.force_temp_mode)
    {
        force_enable_ota_temp(true);
    }
#endif

    if (!is_ota_support_bank_switch()
        && ota_struct.image_id <= IMG_OTA)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

    ota_struct.ota_flag.is_ota_process = true;
    ota_struct.ota_temp_buf_used_size = 0;
    ota_struct.cur_offset = 0;

    fmc_flash_nor_set_bp_lv(flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0), 0);

    return results;
}

/**
    * @brief    Handle buffer check enable cmd
    * @param    p_data      point of output data
    * @param    max_buffer_size     set max buffer size
    * @return   void
    */
static void app_ota_buffer_check_en(uint8_t *p_data, uint16_t max_buffer_size)
{
    uint8_t size_factor = 0;

    if (p_data == NULL)
    {
        return;
    }

    ota_struct.ota_flag.buffer_check_en = true;
    ota_struct.ota_flag.ota_mode = true;

    if (ota_struct.p_ota_temp_buf_head == NULL)
    {
        app_ota_enter();
    }

    while (ota_struct.p_ota_temp_buf_head == NULL)
    {
        ota_struct.buffer_size = max_buffer_size >> size_factor;
        ota_struct.p_ota_temp_buf_head = (uint8_t *)malloc(ota_struct.buffer_size);
        size_factor ++;
        if (ota_struct.buffer_size <= 0)
        {
            break;
        }
    }

    if (ota_struct.p_ota_temp_buf_head == NULL
        || ota_struct.buffer_size == 0)
    {
        ota_struct.ota_flag.buffer_check_en = false;
    }
    p_data[0] = ota_struct.ota_flag.buffer_check_en;
    LE_UINT16_TO_ARRAY(&p_data[1], ota_struct.buffer_size);

    APP_PRINT_TRACE2("app_ota_buffer_check_en: buffer_check_en=%d, buffer_size=%d",
                     ota_struct.ota_flag.buffer_check_en, ota_struct.buffer_size);
}

/**
    * @brief    Handle written request on DFU packet
    * @param    p_data     data to be written
    * @param    length     Length of value to be written
    * @return   handle result  0x01:success other:fail
    */
static uint8_t app_ota_data_packet_handle(uint8_t *p_data, uint16_t length)
{
    uint8_t results = DFU_ARV_SUCCESS;

    APP_PRINT_TRACE4("app_ota_data_packet_handle: length=%d, nCurOffSet=%d, buffer_check_offset=%d, nImageTotalLength=%d",
                     length, ota_struct.cur_offset, ota_struct.buffer_check_offset, ota_struct.image_total_length);

    ota_struct.ota_flag.skip_flag = 1;

    if ((p_data == NULL) || (ota_struct.ota_flag.is_ota_process == false))
    {
        results = DFU_ARV_FAIL_OPERATION;
        return results;
    }

    if (ota_struct.cur_offset + length + ota_struct.ota_temp_buf_used_size >
        ota_struct.image_total_length)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
    }
    else
    {
        if (!ota_struct.ota_flag.buffer_check_en)
        {
            if (app_ota_enc_setting())
            {
                uint16_t offset = 0;
                while ((length - offset) >= 16)
                {
                    aes256_decrypt_16byte(p_data + offset);
                    offset += 16;
                }
            }
            if ((ota_struct.buffer_check_offset != 0) && (ota_struct.p_ota_temp_buf_head == NULL))
            {
                ota_struct.p_ota_temp_buf_head = (uint8_t *)malloc(ota_struct.buffer_check_offset);
            }
            uint32_t flash_write_result = app_ota_write_to_flash(ota_struct.image_id,
                                                                 ota_struct.cur_offset,
                                                                 ota_struct.next_subimage_offset,
                                                                 length,
                                                                 p_data);
            if (flash_write_result != 0)
            {
                APP_PRINT_TRACE1("app_ota_buffer_check_handle: write ret: %d", flash_write_result);
                results = DFU_ARV_FAIL_OPERATION;
            }
            else
            {
                ota_struct.cur_offset += length;
                if ((ota_struct.buffer_check_offset != 0) && (ota_struct.p_ota_temp_buf_head != NULL))
                {
                    ota_struct.buffer_check_offset = 0;
                    free(ota_struct.p_ota_temp_buf_head);
                    ota_struct.p_ota_temp_buf_head = NULL;
                }
            }
        }
        else
        {
            if (ota_struct.ota_temp_buf_used_size + ota_struct.buffer_check_offset + length <=
                ota_struct.buffer_size)
            {
                memcpy(ota_struct.p_ota_temp_buf_head + ota_struct.buffer_check_offset +
                       ota_struct.ota_temp_buf_used_size, p_data, length);
                ota_struct.ota_temp_buf_used_size += length;
            }
            else
            {
                results = DFU_ARV_FAIL_OPERATION;
            }
        }
    }

    return results;
}

/**
    * @brief    Handle written request on DFU packet
    * @param    p_data     point of input data
    * @param    data      point of output data
    * @return   void
    */
static void app_ota_buffer_check_handle(uint8_t *p_data, uint8_t *data)
{
    uint16_t data_size;
    uint16_t crc;

    if ((p_data == NULL) || (ota_struct.ota_flag.is_ota_process == false))
    {
        ota_struct.ota_temp_buf_used_size = 0;
        data[0] = DFU_ARV_FAIL_OPERATION;
        LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        return;
    }

    LE_ARRAY_TO_UINT16(data_size, p_data);
    LE_ARRAY_TO_UINT16(crc, p_data + 2);

    APP_PRINT_TRACE4("app_ota_buffer_check_handle: data_size=%d, ota_temp_buf_used_size=%d, buffer_check_offset=%d, crc=0x%x",
                     data_size, ota_struct.ota_temp_buf_used_size, ota_struct.buffer_check_offset, crc);

