rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
    if (data_size != ota_struct.ota_temp_buf_used_size)
    {
        ota_struct.ota_temp_buf_used_size = 0;
        data[0] = DFU_ARV_FAIL_DATA_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        return;
    }

    if (dfu_checkbufcrc(ota_struct.p_ota_temp_buf_head + ota_struct.buffer_check_offset,
                        ota_struct.ota_temp_buf_used_size, crc))
    {
        ota_struct.ota_temp_buf_used_size = 0;
        ota_struct.buffer_check_offset = 0;
        data[0] = DFU_ARV_FAIL_CRC_ERROR;
        LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
    }
    else
    {
        APP_PRINT_TRACE1("app_ota_buffer_check_handle: write flash, offset=0x%x", ota_struct.cur_offset);
        if (app_ota_enc_setting())
        {
            uint16_t offset = 0;
            while ((ota_struct.ota_temp_buf_used_size - offset) >= 16)
            {
                aes256_decrypt_16byte(ota_struct.p_ota_temp_buf_head + ota_struct.buffer_check_offset + offset);
                offset += 16;
            }
        }

        uint32_t flash_write_result = app_ota_write_to_flash(ota_struct.image_id,
                                                             ota_struct.cur_offset,
                                                             ota_struct.next_subimage_offset,
                                                             ota_struct.ota_temp_buf_used_size + ota_struct.buffer_check_offset,
                                                             ota_struct.p_ota_temp_buf_head);

        APP_PRINT_TRACE1("app_ota_buffer_check_handle: write ret: %d", flash_write_result);

        if (flash_write_result == 0)
        {
            ota_struct.cur_offset += ota_struct.ota_temp_buf_used_size;
            ota_struct.ota_temp_buf_used_size = 0;
            ota_struct.buffer_check_offset = 0;
            data[0] = DFU_ARV_SUCCESS;
            LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
        }
        else
        {
            uint32_t erase_time = 0;
            uint32_t resend_offset = (ota_struct.next_subimage_offset + ota_struct.cur_offset) /
                                     FLASH_SECTOR_SIZE * FLASH_SECTOR_SIZE;

            if (resend_offset < ota_struct.next_subimage_offset)
            {
                ota_struct.ota_temp_buf_used_size = 0;
                data[0] = DFU_ARV_FAIL_FLASH_ERASE_ERROR;
                LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
                return;
            }

            ota_struct.cur_offset = resend_offset - ota_struct.next_subimage_offset;

            while (erase_time < 3)
            {
                if (dfu_flash_erase(ota_struct.image_id, resend_offset) == true)
                {
                    ota_struct.ota_temp_buf_used_size = 0;
                    data[0] = DFU_ARV_FAIL_FLASH_WRITE_ERROR;
                    LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
                    break;
                }
                else
                {
                    erase_time++;
                }
            }
            if (erase_time >= 3)
            {
                ota_struct.ota_temp_buf_used_size = 0;
                data[0] = DFU_ARV_FAIL_FLASH_ERASE_ERROR;
                LE_UINT32_TO_ARRAY(&data[1], ota_struct.cur_offset);
            }
        }
    }
}

#ifdef USER_DATA1_ADDR
T_USER_DATA_ERROR_TYPE dfu_get_user_data_info(USER_IMG_ID image_id,
                                              uint32_t *img_info, bool is_addr)
{
    T_USER_DATA_ERROR_TYPE err_code = USER_DATA_SUCCESS;

    switch (image_id)
    {
    case IMG_USER_DATA1:
        if (USER_DATA1_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA1_ADDR : USER_DATA1_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA2:
        if (USER_DATA2_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA2_ADDR : USER_DATA2_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA3:
        if (USER_DATA3_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA3_ADDR : USER_DATA3_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA4:
        if (USER_DATA4_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA4_ADDR : USER_DATA4_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA5:
        if (USER_DATA5_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA5_ADDR : USER_DATA5_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA6:
        if (USER_DATA6_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA6_ADDR : USER_DATA6_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA7:
        if (USER_DATA7_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA7_ADDR : USER_DATA7_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    case IMG_USER_DATA8:
        if (USER_DATA8_WITH_HEADER)
        {
            *img_info = is_addr ? USER_DATA8_ADDR : USER_DATA8_SIZE;
        }
        else
        {
            err_code = USER_DATA_NOT_SUPPORT_OTA;
            *img_info = 0;
        }
        break;
    default:
        APP_PRINT_ERROR1("error user data image_id 0x%x", image_id);
        err_code = USER_DATA_TYPE_ERROR;
        *img_info = 0;
        break;
    }

    // if (is_addr && (*img_info))
    // {
    //     uint32_t addr = *img_info;
    //     *img_info = FMC_MAIN0_NON_CACHE_ADDR(addr);
    // }

    return err_code;
}

