rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
uint32_t app_trx_get_active_bank_addr(uint16_t image_id)
{
    uint32_t image_addr = 0;

    if ((USER_IMG_ID)image_id < IMG_USER_DATA_MAX && (USER_IMG_ID)image_id >= IMG_USER_DATA_FIRST)
    {
        dfu_get_user_data_info((USER_IMG_ID)image_id, &image_addr, true);
        return image_addr;
    }
    return app_get_active_bank_addr((IMG_ID)image_id);
}

uint32_t app_trx_get_inactive_bank_addr(uint16_t image_id)
{
    uint32_t image_addr = 0;

    if ((USER_IMG_ID)image_id < IMG_USER_DATA_MAX && (USER_IMG_ID)image_id >= IMG_USER_DATA_FIRST)
    {
        dfu_get_user_data_info((USER_IMG_ID)image_id, &image_addr, true);
        return image_addr;
    }

    return app_get_inactive_bank_addr(image_id);
}

bool app_trx_check_image_id(uint16_t image_id)
{
    if (((USER_IMG_ID)image_id >= IMG_USER_DATA_FIRST) && ((USER_IMG_ID)image_id < IMG_USER_DATA_MAX))
    {
        return true;
    }
    return check_image_id(image_id);
}
#endif /*USER_DATA1_ADDR*/

/**
    * @brief    Valid the image
    * @param    p_date     point of input data
    * @return   valid result
    */
static uint8_t app_ota_valid_handle(uint8_t *p_date)
{
    uint8_t results = DFU_ARV_SUCCESS;
    uint16_t image_id;

    if (!ota_struct.ota_flag.skip_flag
        && ota_struct.test.t_skip_fail)
    {
        results = DFU_ARV_FAIL_CRC_ERROR;
        return results;
    }

    ota_struct.ota_flag.skip_flag = 0;

    if (p_date == NULL)
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
        return results;
    }

    LE_ARRAY_TO_UINT16(image_id, p_date);

    if (image_id == ota_struct.image_id)
    {
#ifdef USER_DATA1_ADDR
        if ((USER_IMG_ID)image_id >= IMG_USER_DATA_FIRST && (USER_IMG_ID)image_id < IMG_USER_DATA_MAX)
        {
            app_start_timer(&timer_idx_ota_transfer, "ota_transfer",
                            ota_timer_id, APP_TIMER_OTA_TRANSFER, 0, false,
                            60 * 1000);
        }
#endif
        if (!app_ota_checksum((IMG_ID)image_id, ota_struct.next_subimage_offset))
        {
            results = DFU_ARV_FAIL_CRC_ERROR;
        }
        else
        {
            ota_struct.next_subimage_offset += ota_struct.cur_offset;
            ota_struct.cur_offset = 0;
            if (is_ota_support_bank_switch())
            {
                ota_struct.next_subimage_offset = 0;
            }
#if FORCE_OTA_TEMP
            uint8_t is_last_image;
            LE_ARRAY_TO_UINT8(is_last_image, p_date + 2);
            if (ota_struct.force_temp_mode && is_last_image)
            {
                dfu_set_ota_bank_flag(true);
            }
#endif
#ifdef USER_DATA1_ADDR
            if ((USER_IMG_ID)image_id >= IMG_USER_DATA_FIRST && (USER_IMG_ID)image_id < IMG_USER_DATA_MAX)
            {
                uint32_t base_addr;
                dfu_get_user_data_info((USER_IMG_ID)image_id, &base_addr, true);
                app_ota_set_ready(base_addr);
            }
#endif
        }
    }
    else
    {
        results = DFU_ARV_FAIL_INVALID_PARAMETER;
    }

    return results;
}

/**
    * @brief    get image info for ota
    * @param    *p_data   point of input data
    * @param    *data   point of output data
    * @return   void
    */
static void app_ota_get_img_info_handle(uint8_t *p_data, uint8_t *data)
{
    uint16_t image_id;
    uint32_t dfu_base_addr;

    if ((data == NULL) || (p_data == NULL))
    {
        return;
    }

    LE_ARRAY_TO_UINT16(image_id, p_data);

    if (image_id != ota_struct.image_id)
    {
        ota_struct.cur_offset = 0;
        ota_struct.ota_temp_buf_used_size = 0;
    }

#ifdef USER_DATA1_ADDR
    if (app_trx_check_image_id(image_id) == false)
#else
    if (check_image_id(image_id) == false)
#endif
    {
        data[0] = DFU_ARV_FAIL_INVALID_PARAMETER;
        return;
    }
#ifdef USER_DATA1_ADDR
    dfu_base_addr = app_trx_get_inactive_bank_addr(image_id);
#else
    dfu_base_addr = app_get_inactive_bank_addr(image_id);
#endif

    if ((dfu_base_addr % FMC_SEC_SECTION_LEN) == 0)
    {
        ota_struct.buffer_check_offset = 0;
    }
    else
    {
        ota_struct.buffer_check_offset = dfu_base_addr % 0x1000;
    }

    data[0] = DFU_ARV_SUCCESS;
    LE_UINT32_TO_ARRAY(&data[1], 0);
    LE_UINT32_TO_ARRAY(&data[5], ota_struct.cur_offset);
    LE_UINT16_TO_ARRAY(&data[9], ota_struct.buffer_check_offset);

    APP_PRINT_TRACE2("app_ota_get_img_info_handle: cur_offset=0x%x, buffer_check_offset=0x%x",
                     ota_struct.cur_offset, ota_struct.buffer_check_offset);
}

/**
    * @brief    Disconnect peer for another OTA try
    * @param    conn_id     ID to identify the connection for disconnect
    * @return   void
    */
static void app_ota_le_disconnect(uint8_t conn_id, T_LE_LOCAL_DISC_CAUSE disc_cause)
{
    T_APP_LE_LINK *p_link;
    bool ret;

    p_link = app_link_find_le_link_by_conn_id(conn_id);
    ret = app_ble_gap_disconnect(p_link, disc_cause);

    APP_PRINT_TRACE1("app_ota_le_disconnect ret: %d", ret);
}

/**
    * @brief    Wrapper function to send notification to peer
    * @note
    * @param    conn_id     ID to identify the connection
    * @param    opcode      Notification on the specified opcode
    * @param    len         Notification data length
    * @param    data        Additional notification data
    * @return   void
    */
static void app_ota_service_prepare_send_notify(uint16_t conn_handle, uint16_t cid, uint8_t opcode,
                                                uint16_t len,
                                                uint8_t *data)
{
    uint8_t *p_buffer = NULL;
    uint16_t mtu_size = 102;
    uint16_t remain_size = len;
    uint8_t *p_data = data;
    uint16_t send_len;

    if ((data == NULL) || (len == 0))
    {
        return;
    }

    uint8_t conn_id = 0xFF;
    T_GAP_CHANN_INFO p_info;

    gap_chann_get_info(conn_handle, cid, &p_info);

    if ((p_info.chann_type == GAP_CHANN_TYPE_LE_ATT) ||
        (p_info.chann_type == GAP_CHANN_TYPE_LE_ECFC))
    {
        le_get_conn_id_by_handle(conn_handle, &conn_id);
        le_get_conn_param(GAP_PARAM_CONN_MTU_SIZE, &mtu_size, conn_id);
    }
    else if (p_info.chann_type == GAP_CHANN_TYPE_BREDR_ATT)
    {
        mtu_size = IMG_INFO_LEN + 2;
    }

    p_buffer = malloc(mtu_size);

    if (p_buffer == NULL)
    {
        return;
    }

    if (len < mtu_size - 2)
    {
        p_buffer[0] = DFU_OPCODE_NOTIF;
        p_buffer[1] = opcode;
        memcpy(&p_buffer[2], data, len);
        ota_service_send_notification(conn_handle, cid, p_buffer, len + 2);
        free(p_buffer);
        return;
    }

