rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
    while (remain_size)
    {
        if (remain_size == len)
        {
            p_buffer[0] = DFU_OPCODE_NOTIF;
            p_buffer[1] = opcode;
            memcpy(&p_buffer[2], p_data, mtu_size - 2);
            ota_service_send_notification(conn_handle, cid, p_buffer, mtu_size);
            p_data += (mtu_size - 2);
            remain_size -= (mtu_size - 2);
            continue;
        }

        send_len = (remain_size > mtu_size) ? mtu_size : remain_size;
        memcpy(p_buffer, p_data, send_len);
        ota_service_send_notification(conn_handle, cid, p_buffer, send_len);
        p_data += send_len;
        remain_size -= send_len;
    }

    free(p_buffer);
}

/**
    * @brief    copy image to the other bank
    * @param    p_data    point of input data
    * @return   1: success  other: fail
    */
static uint8_t app_ota_copy_img(uint8_t *p_data)
{
    uint32_t source_base_addr, dest_addr;
    uint32_t offset = 0;
    uint8_t ret = DFU_ARV_SUCCESS;
    uint16_t img_id;
    uint8_t *buffer_addr = ota_struct.p_ota_temp_buf_head;
    uint32_t buffer_size = MAX_BUFFER_SIZE;
    uint8_t *p_copy_buffer = NULL;
    uint8_t bp_lv;
    uint8_t size_factor = 0;

    ota_struct.ota_flag.skip_flag = 1;

    if (ota_struct.test.t_copy_fail)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    if (p_data == NULL)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    LE_ARRAY_TO_UINT16(img_id, p_data);

    if (check_copy_image_id(img_id))
    {
        ret = DFU_ARV_FAIL_INVALID_PARAMETER;
        return ret;
    }

#ifdef USER_DATA1_ADDR
    source_base_addr = app_trx_get_active_bank_addr(img_id);
    dest_addr = app_trx_get_inactive_bank_addr(img_id);
#else
    source_base_addr = app_get_active_bank_addr(img_id);
    dest_addr = app_get_inactive_bank_addr(img_id);
#endif

    if ((source_base_addr % FLASH_SECTOR_SIZE) || (source_base_addr == 0))
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    T_IMG_HEADER_FORMAT *p_data_header = (T_IMG_HEADER_FORMAT *)source_base_addr;
    if (p_data_header->ctrl_header.image_id != img_id)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    uint32_t remain_size = p_data_header->ctrl_header.payload_len + DEFAULT_HEADER_SIZE;

    if (ota_struct.p_ota_temp_buf_head != NULL)
    {
        buffer_size = ota_struct.buffer_size;
    }
    else
    {
        while (p_copy_buffer == NULL && buffer_size)
        {
            buffer_size >>= size_factor;
            p_copy_buffer = (uint8_t *)malloc(buffer_size);
            size_factor ++;
        }

        buffer_addr = p_copy_buffer;
    }

    if (buffer_addr == NULL)
    {
        ret = DFU_ARV_FAIL_OPERATION;
        return ret;
    }

    fmc_flash_nor_get_bp_lv(dest_addr, &bp_lv);

    uint32_t copy_len;
    while (remain_size > 0)
    {
        copy_len = (remain_size > buffer_size) ? buffer_size : remain_size;

        fmc_flash_nor_read(source_base_addr + offset, buffer_addr, copy_len);
        if (app_ota_write_to_flash(img_id, offset, 0, copy_len, buffer_addr) != 0)
        {
            ret = DFU_ARV_FAIL_FLASH_WRITE_ERROR;
            return ret;
        }
        remain_size -= copy_len;
        offset += copy_len;
        if (offset % COPY_WDG_KICK_SIZE == 0)//avoid WDT
        {
            WDG_Kick();
        }
    }

    if (app_ota_checksum((IMG_ID)img_id, 0) == false)
    {
        ret = DFU_ARV_FAIL_CRC_ERROR;
    }

    if (p_copy_buffer != NULL)
    {
        free(p_copy_buffer);
    }

    fmc_flash_nor_set_bp_lv(flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0), bp_lv);

    APP_PRINT_TRACE2("app_ota_copy_img ret: %d image_id: %x", ret, img_id);

    return ret;
}

/**
    * @brief    compare sha256 or crc value with the image in dest addr
    * @param    p_dest    address of the image
    * @param    p_data    sha256 or crc value receive from controler
    * @param    img_id    image id
    * @return   true: same  false: different
    */
static bool app_ota_cmp_checksum(T_IMG_HEADER_FORMAT *p_dest, uint8_t *p_data, IMG_ID img_id)
{
    uint8_t buffer[SHA256_LEN];

#ifdef USER_DATA1_ADDR
    if (app_trx_check_image_id(img_id) == false)
#else
    if (check_image_id(img_id) == false)
#endif
    {
        return false;
    }

    fmc_flash_nor_read((uint32_t)&p_dest->auth.image_hash, buffer, SHA256_LEN);

    return (memcmp(p_data, buffer, SHA256_LEN) == 0);
}

/**
    * @brief    To check if the image in device is same with image needed to update
    * @param    p_data    point of input data
    * @param    data    point of output data
    * @return   void
    */
static void app_ota_check_sha256(uint8_t *p_data, uint8_t *data)
{
    T_IMG_HEADER_FORMAT *img_addr[2];
    uint16_t num = *(uint16_t *)p_data;
    uint8_t buffer[3] = {0};

    if (data == NULL)
    {
        return;
    }

    SHA256_CHECK *p_src = (SHA256_CHECK *)(p_data + 2);

#ifdef USER_DATA1_ADDR
    if (app_trx_check_image_id(p_src->img_id) == false)
#else
    if (check_image_id(p_src->img_id) == false)
#endif
    {
        return;
    }

    for (uint16_t i = 0; i < num; i++)
    {
        memset(buffer, 0, sizeof(buffer));
        *(uint16_t *)buffer = p_src->img_id;

#ifdef USER_DATA1_ADDR
        img_addr[0] = (T_IMG_HEADER_FORMAT *)app_trx_get_inactive_bank_addr(p_src->img_id);
        img_addr[1] = (T_IMG_HEADER_FORMAT *)app_trx_get_active_bank_addr(p_src->img_id);
#else
        img_addr[0] = (T_IMG_HEADER_FORMAT *)app_get_inactive_bank_addr(p_src->img_id);
        img_addr[1] = (T_IMG_HEADER_FORMAT *)app_get_active_bank_addr(p_src->img_id);
#endif

        for (uint8_t j = 0; j < 2; j++)
        {
            if (img_addr[j] && img_addr[j]->ctrl_header.image_id == p_src->img_id
                && app_ota_cmp_checksum(img_addr[j], p_src->sha256, p_src->img_id))
            {
                buffer[2] += (j + 1);
            }
        }
        APP_PRINT_TRACE2("app_ota_check_sha256 img_id: %x buffer[2]: %x, 0: write, 1,3: skip, 2: copy",
                         *(uint16_t *)buffer, buffer[2]);

        memcpy(data, buffer, sizeof(buffer));
        data += sizeof(buffer);
        p_src++;
    }
}

/**
    * @brief    get the ic type of current fw
    * @param    void
    * @return   ic type
    */
static uint8_t app_ota_get_ic_type(void)
{
    uint8_t ic_type = IC_TYPE;
#ifdef USER_DATA1_ADDR
    uint32_t image_addr = app_trx_get_active_bank_addr(IMG_MCUAPP);
#else
    uint32_t image_addr = app_get_active_bank_addr(IMG_MCUAPP);
#endif

    ic_type = ((T_IMG_HEADER_FORMAT *)image_addr)->ctrl_header.ic_type;

    return ic_type;
}

void app_ota_sucess_save_srv_change_info()
{
    APP_PRINT_INFO0("app_ota_sucess_save_srv_change_info");
    T_OTA_SRV_CHANGE_INFO *p_info = NULL;

