rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
    uint8_t bond_num = bt_le_get_max_le_paired_device_num();
    uint8_t srv_change_info_len = sizeof(T_OTA_SRV_CHANGE_INFO) * bond_num;
    p_info = calloc(1, srv_change_info_len);

    if (p_info == NULL)
    {
        return;
    }

    for (uint8_t i = 0; i < bond_num; i++)
    {
        T_LE_BOND_ENTRY *p_entry = bt_le_find_key_entry_by_priority(i + 1);

        if (p_entry != NULL)
        {
            p_info[i].do_srv_change = true;

            if ((p_entry->remote_bd[5] & 0xC0) == 0x40)
            {
                memcpy(p_info[i].remote_addr, p_entry->remote_identity_addr, 6);
            }
            else
            {
                memcpy(p_info[i].remote_addr, p_entry->remote_bd, 6);
            }
        }

        APP_PRINT_TRACE3("app_ota_sucess_save_srv_change_info: i %d, do_srv_change %d, addr %b",
                         i, p_info[i].do_srv_change, TRACE_BDADDR(p_info[i].remote_addr));
    }

    ftl_save_to_storage(p_info, APP_RW_OTA_SRV_CHANGE_INFO_ADDR, srv_change_info_len);

    free(p_info);
    p_info = NULL;
}

bool app_ota_find_srv_change_info(uint8_t *bd_addr, uint8_t *p_idx)
{
    T_OTA_SRV_CHANGE_INFO *p_info = NULL;

    uint8_t bond_num = bt_le_get_max_le_paired_device_num();
    uint8_t srv_change_info_len = sizeof(T_OTA_SRV_CHANGE_INFO) * bond_num;

    p_info = calloc(1, srv_change_info_len);

    if (p_info == NULL)
    {
        return false;
    }

    uint32_t read_result = ftl_load_from_storage(p_info, APP_RW_OTA_SRV_CHANGE_INFO_ADDR,
                                                 srv_change_info_len);

    if (read_result == ENOF)
    {
        memset(p_info, 0, srv_change_info_len);
        ftl_save_to_storage(p_info, APP_RW_OTA_SRV_CHANGE_INFO_ADDR, srv_change_info_len);
        return false;
    }

    for (uint8_t i = 0; i < bond_num; i++)
    {
        if (memcmp(p_info[i].remote_addr, bd_addr, 6) == 0)
        {
            *p_idx = i;
            bool do_srv_change = p_info[i].do_srv_change;
            APP_PRINT_INFO2("app_ota_find_srv_change_info: find i %d, srv change %d", i, do_srv_change);

            free(p_info);
            p_info = NULL;

            return do_srv_change;
        }
    }

    free(p_info);
    p_info = NULL;

    APP_PRINT_INFO0("app_ota_find_srv_change_info: not find");
    return false;
}

bool app_ota_set_srv_change_info(bool do_srv_change, uint8_t idx)
{
    APP_PRINT_INFO2("app_ota_set_srv_change_info: srv_change %d, idx %d", do_srv_change, idx);
    T_OTA_SRV_CHANGE_INFO *p_info = NULL;

    uint8_t bond_num = bt_le_get_max_le_paired_device_num();
    uint8_t srv_change_info_len = sizeof(T_OTA_SRV_CHANGE_INFO) * bond_num;

    p_info = calloc(1, srv_change_info_len);

    if (p_info == NULL)
    {
        return false;
    }

    uint32_t read_result = ftl_load_from_storage(p_info, APP_RW_OTA_SRV_CHANGE_INFO_ADDR,
                                                 srv_change_info_len);

    if (read_result == ENOF)
    {
        memset(p_info, 0, srv_change_info_len);
        ftl_save_to_storage(p_info, APP_RW_OTA_SRV_CHANGE_INFO_ADDR, srv_change_info_len);
        return false;
    }

    p_info[idx].do_srv_change = do_srv_change;

    ftl_save_to_storage(p_info, APP_RW_OTA_SRV_CHANGE_INFO_ADDR, srv_change_info_len);

    free(p_info);
    p_info = NULL;

    return true;
}

void app_ota_send_srv_change_indication_info(uint8_t conn_id)
{
    uint8_t addr[6];
    T_GAP_REMOTE_ADDR_TYPE bd_type;
    uint8_t resolved_addr[6];
    T_GAP_IDENT_ADDR_TYPE resolved_bd_type;
    bool ble_link_back = false;
    uint16_t conn_handle = 0xFF;
    uint16_t start_handle = 1;
    uint16_t end_handle = 0xFFFF;
    bool send_srv_change = false;
    uint8_t idx = 0xFF;

    conn_handle = le_get_conn_handle(conn_id);
    le_get_conn_addr(conn_id, addr, (uint8_t *)&bd_type);

    uint8_t local_bd[GAP_BD_ADDR_LEN];
    uint8_t local_bd_type = LE_BOND_LOCAL_ADDRESS_ANY;

    le_get_conn_local_addr(conn_handle, local_bd, &local_bd_type);

    if (bt_le_resolve_random_address(addr, resolved_addr, &resolved_bd_type) == true)
    {
        T_LE_BOND_ENTRY *p_key_entry = NULL;
        p_key_entry = bt_le_find_key_entry(resolved_addr, (T_GAP_REMOTE_ADDR_TYPE)resolved_bd_type,
                                           local_bd, local_bd_type);

        if (p_key_entry != NULL)
        {
            ble_link_back = true;
            send_srv_change = app_ota_find_srv_change_info(resolved_addr, &idx);
        }
    }
    else
    {
        T_LE_BOND_ENTRY *p_key_entry = NULL;
        p_key_entry = bt_le_find_key_entry(addr, (T_GAP_REMOTE_ADDR_TYPE)bd_type,
                                           local_bd, local_bd_type);

        if (p_key_entry != NULL)
        {
            ble_link_back = true;
            send_srv_change = app_ota_find_srv_change_info(addr, &idx);
        }
    }

    APP_PRINT_INFO2("app_ota_send_srv_change_indication_info: ble_link_back %d, send_srv_change %d",
                    ble_link_back, send_srv_change);

    if (ble_link_back == true && send_srv_change == true)
    {
        gatts_ext_service_changed_indicate(conn_handle, L2C_FIXED_CID_ATT, start_handle, end_handle);
        app_ota_set_srv_change_info(false, idx);
    }
}

/**
    * @brief    clear flag and save ftl before reboot
    * @param    void
    * @return   void
    */
static void app_ota_prepare_to_reboot(void)
{
    app_ota_sucess_save_srv_change_info();

    app_ota_clear_notready_flag();

    app_ota_clear_local(OTA_SUCCESS_REBOOT);

    app_ota_exit();

    if (app_cfg_store_all() != 0)
    {
        APP_PRINT_ERROR0("app_ota_prepare_to_reboot: save nv cfg data error");
    }
}

#ifdef USER_DATA1_ADDR
/**
    * @brief    Used to get image version
    * @param    *p_data   point of image version
    * @param    bank   0:active bank    1:inactive bank
    * @return   void
    */
void app_trx_ota_get_img_version(uint8_t *p_data, uint8_t bank)
{
    T_IMG_HEADER_FORMAT *p_header;
    uint32_t addr = 0;
    uint8_t num = 0;
    uint32_t size;
    uint8_t *p_temp;
    uint8_t buffer[6] = {0};

    app_ota_get_img_version(p_data, bank);
    num = p_data[0];
    p_temp = p_data + 1 + num * sizeof(buffer);

    for (USER_IMG_ID user_data_image_id = IMG_USER_DATA_FIRST; user_data_image_id < IMG_USER_DATA_MAX;
         user_data_image_id++)
    {
        dfu_get_user_data_info(user_data_image_id, &addr, true);
        dfu_get_user_data_info(user_data_image_id, &size, false);
        p_header = (T_IMG_HEADER_FORMAT *)addr;

        if (size == 0 || p_header == NULL || size == 0xffffffff)
        {
            continue;
        }

