rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
        *(uint16_t *)buffer = user_data_image_id;
        *(uint32_t *)&buffer[2] = p_header->git_ver.version;

        num ++;
        memcpy(p_temp, buffer, sizeof(buffer));
        p_temp += sizeof(buffer);
    }

    *p_data = num;
}
#endif

/*============================================================================*
 *                              Public Functions
 *============================================================================*/
/**
    * @brief    check the integrity of the image
    * @param    image_id    image id
    * @param    offset  address offset
    * @return   ture:success ; false: fail
    */
bool app_ota_checksum(IMG_ID image_id, uint32_t offset)
{
    uint32_t base_addr = 0;
    bool ret = false;
    bool wdg_en = false;
    bool aon_wdg_en = false;
    T_WATCH_DOG_TIMER_REG wdg_ctrl_value;

#ifdef USER_DATA1_ADDR
    base_addr = app_trx_get_inactive_bank_addr(image_id);
#else
    base_addr = app_get_inactive_bank_addr(image_id);
#endif

    if (base_addr == 0)
    {
        return false;
    }

    base_addr += offset;
    wdg_ctrl_value.d32 = WDG->WDG_CTL;
    wdg_en = wdg_ctrl_value.b.en_byte == 0xA5;
    aon_wdg_en = aon_wdg_is_enable(AON_WDG2);
    if (wdg_en)
    {
        wdg_start(WDG_TIMEOUT_TIME_MS, (T_WDG_MODE)wdg_ctrl_value.b.wdg_mode);
    }
    if (aon_wdg_en)
    {
        aon_wdg_disable(AON_WDG2);
    }

    ret = check_image_sum(base_addr);

    if (wdg_en)
    {
        WDG_Config(wdg_ctrl_value.b.div_factor, wdg_ctrl_value.b.cnt_limit,
                   (T_WDG_MODE)wdg_ctrl_value.b.wdg_mode);
    }
    if (aon_wdg_en)
    {
        aon_wdg_kick(AON_WDG2);
        aon_wdg_enable(AON_WDG2);
    }

    if (ret == true && !is_ota_support_bank_switch())
    {
        app_ota_set_ready(base_addr);
        //btaon_fast_write_safe(BTAON_FAST_AON_GPR_15, image_id);
    }

    APP_PRINT_TRACE2("dfu_check_checksum base_addr:%x, ret:%d", base_addr, ret);

    return ret;
}

/**
    * @brief    write data to flash
    * @param    img_id  image id
    * @param    offset  image offset
    * @param    total_offset  total offset when ota temp mode
    * @param    p_void  point of data
    * @return   0: success; other: fail
    */
uint32_t app_ota_write_to_flash(uint16_t img_id, uint32_t offset, uint32_t total_offset,
                                uint32_t length, void *p_void)
{
    uint32_t dfu_base_addr;
    uint8_t readback_buffer[READBACK_BUFFER_SIZE];
    uint32_t read_back_len;
    uint32_t dest_addr;
    uint8_t *p_src = (uint8_t *)p_void;
    uint32_t remain_size = length;

    if (p_void == 0)
    {
        return __LINE__;
    }

#ifdef USER_DATA1_ADDR
    dfu_base_addr = app_trx_get_inactive_bank_addr(img_id);
#else
    dfu_base_addr = app_get_inactive_bank_addr(img_id);
#endif

    if (dfu_base_addr == 0)
    {
        return __LINE__;
    }

    if (ota_struct.buffer_check_offset != 0)
    {
        dfu_base_addr -= ota_struct.buffer_check_offset;
        fmc_flash_nor_read(dfu_base_addr, ota_struct.p_ota_temp_buf_head, ota_struct.buffer_check_offset);
    }

    dfu_base_addr += total_offset;

    if (offset == 0)
    {
        T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *)p_void;

        p_header->ctrl_header.ctrl_flag.not_ready = 0x1;
        APP_PRINT_TRACE1("app_ota_write_to_flash dfu_base_addr:0x%x", dfu_base_addr);
    }

    if (((offset + dfu_base_addr) % FMC_SEC_SECTION_LEN) == 0)
    {
        fmc_flash_nor_erase(dfu_base_addr + offset, FMC_FLASH_NOR_ERASE_SECTOR);
    }
    else
    {
        if (((offset + dfu_base_addr) / FMC_SEC_SECTION_LEN) != ((offset + length + dfu_base_addr) /
                                                                 FMC_SEC_SECTION_LEN))
        {
            if ((offset + length + dfu_base_addr) % FMC_SEC_SECTION_LEN)
            {
                fmc_flash_nor_erase((dfu_base_addr + offset + length) & ~(FMC_SEC_SECTION_LEN - 1),
                                    FMC_FLASH_NOR_ERASE_SECTOR);
            }
        }
    }

    if ((!ota_struct.ota_flag.buffer_check_en) && (ota_struct.buffer_check_offset != 0))
    {
        dest_addr = dfu_base_addr + offset + ota_struct.buffer_check_offset;
        fmc_flash_nor_write(dest_addr, p_void, length);
        fmc_flash_nor_write(dest_addr - ota_struct.buffer_check_offset, ota_struct.p_ota_temp_buf_head,
                            ota_struct.buffer_check_offset);
    }
    else
    {
        dest_addr = dfu_base_addr + offset;
        fmc_flash_nor_write(dest_addr, p_void, length);
    }

    cache_flush_by_addr((uint32_t *)dest_addr, length);

    while (remain_size)
    {
        read_back_len = (remain_size >= READBACK_BUFFER_SIZE) ? READBACK_BUFFER_SIZE : remain_size;

        fmc_flash_nor_read(dest_addr, readback_buffer, read_back_len);
        if (memcmp(readback_buffer, p_src, read_back_len) != 0)
        {
            return __LINE__;
        }

        dest_addr += read_back_len;
        p_src += read_back_len;
        remain_size -= read_back_len;
    }

    APP_PRINT_TRACE1("app_ota_write_to_flash dest_addr: %x", dfu_base_addr + offset);
    return 0;
}

/**
    * @brief    Used to get image version for ota dongle
    * @param    *p_data   point of image version
    * @return   void
    */
void app_ota_get_brief_img_version_for_dongle(uint8_t *p_data)
{
    T_IMG_HEADER_FORMAT *addr;
    uint16_t img_id;
    uint8_t buffer[4] = {0};
    uint8_t buffer_ota_header[4] = {0};
    uint8_t *p_temp = p_data;
    uint32_t size;
    T_IMG_HEADER_FORMAT *ota_header;

    for (IMG_ID i = IMG_OTA; i < IMG_EXT1; i++)
    {
        img_id = app_change_seq_appdata_dspdata(i);

#ifdef USER_DATA1_ADDR
        addr = (T_IMG_HEADER_FORMAT *)app_trx_get_active_bank_addr(img_id);
#else
        addr = (T_IMG_HEADER_FORMAT *)app_get_active_bank_addr(img_id);
#endif

        if (img_id == IMG_OTA)
        {
            ota_header = (T_IMG_HEADER_FORMAT *)addr;
        }

        size = ota_header->image_info[(img_id - IMG_SBL) * 2 + 1];

        if (size == 0 || addr == 0 || size == 0xffffffff)
        {
            *(uint32_t *)&buffer[0] = 0xFFFFFFFF;
        }
        else
        {
            if (img_id == IMG_OTA)
            {
                *(uint32_t *)&buffer[0] = addr->ver_val;
            }
            else if (img_id > IMG_OTA)
            {
                if (addr->ctrl_header.image_id == img_id)
                {
                    *(uint32_t *)&buffer[0] = addr->git_ver.version;
                }
            }
        }

        if (img_id == IMG_OTA)
        {
            // inorder to fit OTA dongle's format, OTA header need to placed at the end
            memcpy(buffer_ota_header, buffer, sizeof(buffer));
        }
        else
        {
            memcpy(p_temp, buffer, sizeof(buffer));
            p_temp += sizeof(buffer);
        }
    }

    // copy ota header to the tail
    memcpy(p_temp, buffer_ota_header, sizeof(buffer_ota_header));
    p_temp += sizeof(buffer_ota_header);
}

/**
    * @brief    Used to get device information
    * @param    p_data    point of device info data
    * @param    ota_mode  spp ota or ble ota
    * @return   void
    */
void app_ota_get_device_info(SPP_DEVICE_INFO *p_deviceinfo)
{
    if (p_deviceinfo == NULL)
    {
        return;
    }

