rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
    memset(p_deviceinfo, 0, sizeof(SPP_DEVICE_INFO));
    p_deviceinfo->ic_type = app_ota_get_ic_type();
    p_deviceinfo->mode.buffercheck_en = ota_struct.test.t_buffercheck_disable ? 0 : 1;
    p_deviceinfo->mode.aes_en = app_ota_enc_setting();
    p_deviceinfo->mode.aes_mode = 1;
    p_deviceinfo->mode.support_multiimage = 1;
    p_deviceinfo->status.b2b_status = app_ota_check_ota_mode();
    p_deviceinfo->status.fc_bud_role = app_cfg_const.bud_role;
    p_deviceinfo->ota_temp_size = flash_partition_size_get(PARTITION_FLASH_OTA_TMP) / UINT_4K;
    p_deviceinfo->banknum = app_ota_get_active_bank();
    p_deviceinfo->mtu_size = MTU_SIZE;

    ota_struct.ota_flag.is_devinfo = 1;
    ota_struct.ota_flag.is_rws = (p_deviceinfo->status.b2b_status == RWS_B2B_CONNECT);

    fmc_flash_nor_get_bp_lv(flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0),
                            &ota_struct.bp_level);
}

/**
    * @brief  The main function to handle all the spp ota command
    * @param  length length of command id and data
    * @param  p_value data addr
    * @param  app_idx received rx command device index
    * @return void
    */
void app_ota_cmd_handle(uint8_t path, uint16_t length, uint8_t *p_value, uint8_t app_idx)
{
    uint8_t ack_pkt[3];
    uint16_t cmd_id = *(uint16_t *)p_value;
    uint8_t *p;
    uint8_t results = DFU_ARV_SUCCESS;

    bool ack_flag = false;

    ack_pkt[0] = p_value[0];
    ack_pkt[1] = p_value[1];
    ack_pkt[2] = CMD_SET_STATUS_COMPLETE;

    if (length < 2)
    {
        ack_pkt[2] = CMD_SET_STATUS_PARAMETER_ERROR;
        app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
        APP_PRINT_ERROR0("app_ota_cmd_handle: error length");
        return;
    }

    length = length - 2;
    p = p_value + 2;

    APP_PRINT_TRACE2("===>app_ota_cmd_handle, cmd_id:%x, length:%x\n", cmd_id, length);

    if (ota_struct.ota_flag.is_ota_process)
    {
        app_start_timer(&timer_idx_ota_transfer, "ota_transfer",
                        ota_timer_id, APP_TIMER_OTA_TRANSFER, 0, false,
                        30 * 1000);
    }

    switch (cmd_id)
    {
    case CMD_OTA_DEV_INFO:
        {
            if (length == OTA_LENGTH_OTA_GET_INFO)
            {
                SPP_DEVICE_INFO dev_info;

                memcpy(ota_struct.bd_addr, app_db.br_link[app_idx].bd_addr, sizeof(ota_struct.bd_addr));
                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                app_ota_get_device_info(&dev_info);
                dev_info.spec_ver = SPP_OTA_VERSION;
                app_report_event(path, EVENT_OTA_DEV_INFO, app_idx, (uint8_t *)&dev_info, sizeof(dev_info));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_IMG_VER:
        {
            if (length == OTA_LENGTH_OTA_GET_IMG_VER)
            {
                uint8_t data[IMG_INFO_LEN] = {0};

                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                data[0] = *p;
#ifdef USER_DATA1_ADDR
                app_trx_ota_get_img_version(&data[1], data[0]);
#else
                app_ota_get_img_version(&data[1], data[0]);
#endif
                app_report_event(path, EVENT_OTA_ACTIVE_BANK_VER, app_idx, (uint8_t *)data,
                                 IMG_INFO_LEN);
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_START:
        {
            if (length == OTA_LENGTH_START_OTA)
            {
                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                results  = app_ota_start_dfu_handle(p);
                app_sniff_mode_b2s_disable(ota_struct.bd_addr, SNIFF_DISABLE_MASK_OTA);
                app_report_event(path, EVENT_OTA_START, app_idx, &results, sizeof(results));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_PACKET:
        {
            results = app_ota_data_packet_handle(p, length);
            if (results == DFU_ARV_FAIL_INVALID_PARAMETER)
            {
                ack_pkt[2] = CMD_SET_STATUS_PARAMETER_ERROR;
            }
            else if (results == DFU_ARV_FAIL_OPERATION)
            {
                ack_pkt[2] = CMD_SET_STATUS_PROCESS_FAIL;
            }
            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
        }
        break;
    case CMD_OTA_VALID:
        {
            if (length == OTA_LENGTH_VALID_FW)
            {
                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                results = app_ota_valid_handle(p);
                app_report_event(path, EVENT_OTA_VALID, app_idx, &results, sizeof(results));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_ACTIVE_RESET:
        {
            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            if (app_ota_check_ota_mode() != RWS_B2B_CONNECT && ota_struct.ota_flag.is_rws)
            {
                results = DFU_ARV_FAIL_OPERATION;
            }
            app_report_event(path, EVENT_OTA_ACTIVE_ACK, app_idx, &results, 1);
        }
        break;
    case CMD_OTA_ROLESWAP:
        {
            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            ota_struct.ota_flag.roleswap = *p;
            if (app_ota_check_ota_mode() != RWS_B2B_CONNECT)
            {
                results = DFU_ARV_FAIL_OPERATION;
            }
            app_report_event(path, EVENT_OTA_ROLESWAP, app_idx, &results, 1);
        }
        break;
    case CMD_OTA_RESET:
        {
            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            app_ota_error_clear_local(OTA_RESET_CMD);
        }
        break;
    case CMD_OTA_IMG_INFO:
        {
            if (length == OTA_LENGTH_IMAGE_INFO)
            {
                uint8_t data[TARGET_INFO_LEN] = {0};

                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                app_ota_get_img_info_handle(p, data);
                app_report_event(path, EVENT_OTA_IMG_INFO, app_idx, data, sizeof(data));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_BUFFER_CHECK_ENABLE:
        {
            if (length  == OTA_LENGTH_BUFFER_CHECK_EN)
            {
                uint8_t data[BUFFER_CHECK_LEN] = {0};

                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                app_ota_buffer_check_en(data, MAX_BUFFER_SIZE);
                app_report_event(path, EVENT_OTA_BUFFER_CHECK_ENABLE, app_idx, data, sizeof(data));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_BUFFER_CHECK:
        {
            if (length  == OTA_LENGTH_BUFFER_CRC)
            {
                uint8_t data[BUFFER_CHECK_LEN] = {0};

                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                app_ota_buffer_check_handle(p, &data[0]);
                app_report_event(path, EVENT_OTA_BUFFER_CHECK, app_idx, data, sizeof(data));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_SECTION_SIZE:
        {
            if (length == OTA_LENGTH_SECTION_SIZE)
            {
                uint8_t data[IMG_INFO_LEN] = {0};

                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                app_ota_get_section_size(data);
                app_report_event(path, EVENT_OTA_SECTION_SIZE, app_idx, (uint8_t *)data,
                                 IMG_INFO_LEN);
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_DEV_EXTRA_INFO:
        {
            if (length  == OTA_LRNGTH_OTHER_INFO)
            {
                uint8_t data[EXTRA_INFO_LEN] = {0};

                app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
                app_report_event(path, EVENT_OTA_DEV_EXTRA_INFO, app_idx, data, sizeof(data));
            }
            else
            {
                ack_flag = true;
            }
        }
        break;
    case CMD_OTA_PROTOCOL_TYPE:
        {
            uint8_t data[SPEC_VER_LEN] = {0};

            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            *(uint16_t *)data = SPP_PROTOCOL_INFO;
            data[2] = SPP_OTA_VERSION;
            app_report_event(path, EVENT_OTA_PROTOCOL_TYPE, app_idx, (uint8_t *)&data, SPEC_VER_LEN);
        }
        break;
    case CMD_OTA_GET_RELEASE_VER:
        {
            uint8_t data[RELEASE_VER_LEN * 2] = {0};
            uint32_t p_imgheader;

            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);

#ifdef USER_DATA1_ADDR
            p_imgheader = app_trx_get_active_bank_addr(IMG_MCUCONFIG);
#else
            p_imgheader = app_get_active_bank_addr(IMG_MCUCONFIG);
#endif

            memcpy(data, (uint8_t *)(p_imgheader + RELEASE_VER_OFFSET), RELEASE_VER_LEN);

#ifdef USER_DATA1_ADDR
            p_imgheader = app_trx_get_active_bank_addr(IMG_ANC);
#else
            p_imgheader = app_get_active_bank_addr(IMG_ANC);
#endif
            memcpy(data + RELEASE_VER_LEN, (uint8_t *)(p_imgheader + RELEASE_VER_OFFSET), RELEASE_VER_LEN);

            app_report_event(path, EVENT_OTA_GET_RELEASE_VER, app_idx, data, sizeof(data));
        }
        break;
    case CMD_OTA_COPY_IMG:
        {
            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            results = app_ota_copy_img(p);
            app_report_event(path, EVENT_OTA_COPY_IMG, app_idx, &results, sizeof(results));
        }
        break;
    case CMD_OTA_CHECK_SHA256:
        {
            uint8_t data[CHECK_SHA256_LEN] = {0};
            uint16_t num = *(uint16_t *)p;

            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            app_ota_check_sha256(p, data);
            app_report_event(path, EVENT_OTA_CHECK_SHA256, app_idx, data, num * 3);
        }
        break;
    case CMD_OTA_TEST_EN:
        {
            app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
            memcpy(&ota_struct.test.value, p, sizeof(ota_struct.test.value));
        }
        break;
    default:
        ack_pkt[2] = CMD_SET_STATUS_UNKNOW_CMD;
        app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
        break;
    }

    if (ack_flag == true)
    {
        APP_PRINT_TRACE0("app_ota_cmd_handle: invalid length");
        ack_pkt[2] = CMD_SET_STATUS_PARAMETER_ERROR;
        app_report_event(path, EVENT_ACK, app_idx, ack_pkt, 3);
    }
}

/**
    * @brief  handle the active reset event ack
    * @param  event_id  event id of ack
    * @param  status  the status of the ack
    * @return void
    */
void app_ota_cmd_ack_handle(uint16_t event_id, uint8_t status)
{
    APP_PRINT_TRACE2("app_ota_cmd_ack_handle: event_id: %x, status: %d", event_id, status);
    if (status == CMD_SET_STATUS_COMPLETE)
    {
        if (app_ota_check_ota_mode() != RWS_B2B_CONNECT)
        {
            if (ota_struct.ota_flag.is_rws)
            {
                app_ota_error_clear_local(OTA_B2B_DISC);
                return;
            }
        }

        if (event_id == EVENT_OTA_ACTIVE_ACK)
        {
            app_stop_timer(&timer_idx_ota_transfer);
            ota_struct.ota_flag.is_ota_process = false;
            if (app_ota_check_ota_mode() != RWS_B2B_CONNECT)
            {
                app_ota_prepare_to_reboot();
                app_ota_disc_b2s_profile();
                app_start_timer(&timer_idx_ota_reset, "ota_reset",
                                ota_timer_id, APP_TIMER_OTA_RESET, 0, false,
                                3000);
            }
            else
            {
                APP_PRINT_TRACE0("app_ota_cmd_ack_handle:rws active reset");
                ota_struct.rws_mode.valid_ret.cur_bud = 1;
                //app_ota_rws_send_msg(SPP_OTA_MODE, RWS_OTA_UPDATE_RET, UPDATE_SUCCESS);
            }
        }
        else if (event_id == EVENT_OTA_ROLESWAP)
        {
            APP_PRINT_TRACE1("app_ota_cmd_ack_handle roleswap mdoe: %d", ota_struct.ota_flag.roleswap);

            app_stop_timer(&timer_idx_ota_transfer);
            if (!ota_struct.ota_flag.roleswap)
            {
                ota_struct.rws_mode.valid_ret.cur_bud = 1;
                ota_struct.ota_flag.is_ota_process = false;
                //app_ota_rws_send_msg(SPP_OTA_MODE, RWS_OTA_UPDATE_RET, UPDATE_SUCCESS);
            }
            ota_struct.ota_flag.roleswap = 0;
            app_mmi_handle_action(MMI_START_ROLESWAP);
        }
    }
}

/**
    * @brief    Handle written request on DFU control point characteristic
    * @param    conn_id     ID to identify the connection
    * @param    length      Length of value to be written
    * @param    p_value     Value to be written
    * @return   T_APP_RESULT
    * @retval   Handle result of this request
    */
T_APP_RESULT app_ota_ble_handle_cp_req(uint16_t conn_handle, uint16_t cid, uint16_t length,
                                       uint8_t *p_value)
{
    T_APP_RESULT cause = APP_RESULT_INVALID_PDU;
    uint8_t results = DFU_ARV_SUCCESS;
    uint8_t opcode = *p_value;
    uint8_t *p = p_value + 1;
    bool error_flag = false;
    uint8_t conn_id = 0xFF;
    T_GAP_CHANN_INFO p_info;

    gap_chann_get_info(conn_handle, cid, &p_info);

