rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
    if ((p_info.chann_type == GAP_CHANN_TYPE_LE_ATT) ||
        (p_info.chann_type == GAP_CHANN_TYPE_LE_ECFC))
    {
        le_get_conn_id_by_handle(conn_handle, &conn_id);
    }

    APP_PRINT_INFO2("===>app_ota_ble_handle_cp_req, opcode:%x, length:%x\n", opcode, length);

    if (opcode > DFU_OPCODE_MIN && opcode <= DFU_OPCODE_TEST_EN
        && ota_struct.ota_flag.is_ota_process)
    {
        app_start_timer(&timer_idx_ota_transfer, "ota_transfer",
                        ota_timer_id, APP_TIMER_OTA_TRANSFER, 0, false,
                        30 * 1000);
    }

    switch (opcode)
    {
    case DFU_OPCODE_START_DFU:
        {
            if (length == DFU_LENGTH_START_DFU + DATA_PADDING)   /* 4 bytes is pending for encrypt */
            {
                gap_chann_get_info(conn_handle, cid, &p_info);
                if (p_info.chann_type == GAP_CHANN_TYPE_BREDR_ATT)
                {
                    uint8_t addr_type;
                    if (!gap_chann_get_addr(conn_handle, ota_struct.bd_addr, &addr_type))
                    {
                        APP_PRINT_ERROR0("app_ota_ble_handle_cp_req get bredr addr error");
                    }
                    app_sniff_mode_b2s_disable(ota_struct.bd_addr, SNIFF_DISABLE_MASK_OTA);
                    APP_PRINT_INFO1("app_ota_ble_handle_cp_req, ota_struct.bd_addr %s",
                                    TRACE_BDADDR(ota_struct.bd_addr));
                }
                cause = APP_RESULT_SUCCESS;
                results = app_ota_start_dfu_handle(p);
                app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_START_DFU, sizeof(results),
                                                    &results);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_RECEIVE_FW_IMAGE_INFO:
        {
            if (length == DFU_LENGTH_RECEIVE_FW_IMAGE_INFO)
            {
                uint16_t image_id;

                LE_ARRAY_TO_UINT16(image_id, p);
                cause = APP_RESULT_SUCCESS;
                if (image_id == ota_struct.image_id)
                {
                    LE_ARRAY_TO_UINT32(ota_struct.cur_offset, p + 2);
                    APP_PRINT_TRACE2("app_ota_ble_handle_cp_req: image_id = 0x%x, nCurOffSet = %d",
                                     image_id, ota_struct.cur_offset);
                }
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_VALID_FW:
        {
            if (length == DFU_LENGTH_VALID_FW)
            {
                cause = APP_RESULT_SUCCESS;
                results = app_ota_valid_handle(p);
                app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_VALID_FW, sizeof(results),
                                                    &results);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_ACTIVE_IMAGE_RESET:
        {
            cause = APP_RESULT_SUCCESS;
            app_stop_timer(&timer_idx_ota_transfer);
            gap_chann_get_info(conn_handle, cid, &p_info);
            ota_struct.ota_flag.is_ota_process = false;

            if (app_ota_check_ota_mode() != RWS_B2B_CONNECT)
            {
                if (ota_struct.ota_flag.is_rws)
                {
                    cause = APP_RESULT_APP_ERR;
                    app_ota_error_clear_local(OTA_B2B_DISC);
                    break;
                }

                app_ota_prepare_to_reboot();

                if ((p_info.chann_type == GAP_CHANN_TYPE_LE_ATT) ||
                    (p_info.chann_type == GAP_CHANN_TYPE_LE_ECFC))
                {
                    app_ota_le_disconnect(conn_id, LE_LOCAL_DISC_CAUSE_OTA_RESET);
                }
                else if (p_info.chann_type == GAP_CHANN_TYPE_BREDR_ATT)
                {
                    app_ota_disc_b2s_profile();
                    app_start_timer(&timer_idx_ota_reset, "ota_reset",
                                    ota_timer_id, APP_TIMER_OTA_RESET, 0, false,
                                    3000);
                }
            }
            else
            {
                ota_struct.rws_mode.valid_ret.cur_bud = 1;
                if ((p_info.chann_type == GAP_CHANN_TYPE_LE_ATT) ||
                    (p_info.chann_type == GAP_CHANN_TYPE_LE_ECFC))
                {
                    // app_ota_rws_send_msg(BLE_OTA_MODE, RWS_OTA_UPDATE_RET, UPDATE_SUCCESS);
                    app_ota_le_disconnect(conn_id, LE_LOCAL_DISC_CAUSE_UNKNOWN);
                }
                else if (p_info.chann_type == GAP_CHANN_TYPE_BREDR_ATT)
                {
                    // app_ota_rws_send_msg(ATT_OVER_BREDR_MODE, RWS_OTA_UPDATE_RET, UPDATE_SUCCESS);
                    // if (ota_struct.rws_mode.valid_ret.oth_bud == 0)
                    // {
                    //     app_mmi_handle_action(MMI_START_ROLESWAP);
                    // }
                }
            }
        }
        break;
    case DFU_OPCODE_SYSTEM_RESET:
        {
            cause = APP_RESULT_SUCCESS;
            app_ota_error_clear_local(OTA_RESET_CMD);
            if ((p_info.chann_type == GAP_CHANN_TYPE_LE_ATT) ||
                (p_info.chann_type == GAP_CHANN_TYPE_LE_ECFC))
            {
                app_ota_le_disconnect(conn_id, LE_LOCAL_DISC_CAUSE_UNKNOWN);
            }
        }
        break;
    case DFU_OPCODE_REPORT_TARGET_INFO:
        {
            if (length == DFU_LENGTH_REPORT_TARGET_INFO)
            {
                uint8_t notif_data[TARGET_INFO_LEN] = {0};

                cause = APP_RESULT_SUCCESS;
                app_ota_get_img_info_handle(p, notif_data);
                app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_REPORT_TARGET_INFO,
                                                    TARGET_INFO_LEN,
                                                    notif_data);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_BUFFER_CHECK_EN:
        {
            if (length  == DFU_LENGTH_BUFFER_CHECK_EN)
            {
                uint8_t notif_data[BUFFER_CHECK_LEN] = {0};

                cause = APP_RESULT_SUCCESS;
                app_ota_buffer_check_en(notif_data, MAX_BUFFER_SIZE);
                app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_BUFFER_CHECK_EN, BUFFER_CHECK_LEN,
                                                    notif_data);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_REPORT_BUFFER_CRC:
        {
            if (length  == DFU_LENGTH_REPORT_BUFFER_CRC)
            {
                uint8_t notif_data[BUFFER_CHECK_LEN] = {0};

                cause = APP_RESULT_SUCCESS;
                app_ota_buffer_check_handle(p, notif_data);
                app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_REPORT_BUFFER_CRC,
                                                    BUFFER_CHECK_LEN,
                                                    notif_data);
            }
            else
            {
                error_flag = true;
            }
        }
        break;
    case DFU_OPCODE_COPY_IMG:
        {
            cause = APP_RESULT_SUCCESS;
            results = app_ota_copy_img(p);
            app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_COPY_IMG, 1, &results);
        }
        break;
    case DFU_OPCODE_GET_IMAGE_VER:
        {
            uint8_t notif_data[IMG_INFO_LEN] = {0};

            cause = APP_RESULT_SUCCESS;
            notif_data[0] = *p;
#ifdef USER_DATA1_ADDR
            app_trx_ota_get_img_version(&notif_data[1], notif_data[0]);
#else
            app_ota_get_img_version(&notif_data[1], notif_data[0]);
#endif
            app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_GET_IMAGE_VER, IMG_INFO_LEN,
                                                notif_data);
        }
        break;
    case DFU_OPCODE_GET_SECTION_SIZE:
        {
            uint8_t notif_data[IMG_INFO_LEN] = {0};

            cause = APP_RESULT_SUCCESS;
            app_ota_get_section_size(notif_data);
            app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_GET_SECTION_SIZE, IMG_INFO_LEN,
                                                notif_data);
        }
        break;
    case DFU_OPCODE_CHECK_SHA256:
        {
            uint8_t notif_data[CHECK_SHA256_LEN] = {0};
            uint16_t num = *(uint16_t *)p;

            cause = APP_RESULT_SUCCESS;
            app_ota_check_sha256(p, notif_data);
            app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_CHECK_SHA256, num * 3, notif_data);
        }
        break;
    case DFU_OPCODE_GET_RELEASE_VER:
        {
            uint8_t notif_data[RELEASE_VER_LEN] = {0};
#ifdef USER_DATA1_ADDR
            uint32_t p_imgheader = app_trx_get_active_bank_addr(IMG_MCUCONFIG);
#else
            uint32_t p_imgheader = app_get_active_bank_addr(IMG_MCUCONFIG);
#endif

            cause = APP_RESULT_SUCCESS;
            memcpy(notif_data, (uint8_t *)(p_imgheader + RELEASE_VER_OFFSET), RELEASE_VER_LEN);
            app_ota_service_prepare_send_notify(conn_handle, cid, DFU_OPCODE_GET_RELEASE_VER, RELEASE_VER_LEN,
                                                notif_data);
        }
        break;
    case DFU_OPCODE_TEST_EN:
        {
            cause = APP_RESULT_SUCCESS;
            memcpy(&ota_struct.test.value, p, sizeof(ota_struct.test.value));
        }
        break;
    default:
        APP_PRINT_ERROR1("app_ota_ble_handle_cp_req, opcode not expected", opcode);
        break;
    }

    if (error_flag)
    {
        APP_PRINT_ERROR0("app_ota_ble_handle_cp_req: invalid length");
    }

    return cause;
}

/**
    * @brief    Handle written request on DFU packet characteristic
    * @param    conn_id     ID to identify the connection
    * @param    length      Length of value to be written
    * @param    p_value     Value to be written
    * @return   T_APP_RESULT
    * @retval   Handle result of this request
    */
T_APP_RESULT app_ota_ble_handle_packet(uint8_t conn_id, uint16_t length, uint8_t *p_value)
{
    uint8_t result;

    result = app_ota_data_packet_handle(p_value, length);

    if (result == DFU_ARV_FAIL_INVALID_PARAMETER)
    {
        return APP_RESULT_INVALID_PDU;
    }
    else if (result == DFU_ARV_FAIL_OPERATION)
    {
        return APP_RESULT_APP_ERR;
    }

    return APP_RESULT_SUCCESS;
}


/**
    * @brief  ota callback register
    * @param  void
    * @return void
    */
void app_ota_init(void)
{
    app_timer_reg_cb(app_ota_timeout_cb, &ota_timer_id);
    //dfu_init();

