rtkconnectivity/RTL876x3E-Common-SDK/src/sample/bt_audio_trx/ota/app_ota.c
}

/**
    * @brief  get image size of bank area
    * @param  image_id image ID
    * @return size
    */
uint32_t get_bank_size_by_img_id(IMG_ID image_id)
{
    uint32_t bank_size;

    T_IMG_HEADER_FORMAT *ota_header = (T_IMG_HEADER_FORMAT *)get_active_ota_bank_addr();
    bank_size = ota_header->image_info[(image_id - IMG_SBL) * 2 + 1];

    return bank_size;
}

void app_ota_le_disconnect_cb(uint8_t conn_id, uint8_t local_disc_cause, uint16_t disc_cause)
{
    if (app_ble_cfg.rtk_app_adv_support)
    {
        if (local_disc_cause == LE_LOCAL_DISC_CAUSE_SWITCH_TO_OTA)
        {
            if (app_cfg_store_all() != 0)
            {
                APP_PRINT_ERROR0("le_handle_new_conn_state_evt: save nv cfg data error");
            }

            APP_PRINT_TRACE0("Switch into OTA mode now...");
            //dfu_switch_to_ota_mode();
            return;
        }
        else if (local_disc_cause == LE_LOCAL_DISC_CAUSE_OTA_RESET)
        {
            app_ota_disc_b2s_profile();
            app_start_timer(&timer_idx_ota_reset, "ota_reset",
                            ota_timer_id, APP_TIMER_OTA_RESET, 0, false,
                            3000);
            return;
        }
        else if (local_disc_cause == LE_LOCAL_DISC_CAUSE_UNKNOWN)
        {
            if (app_ota_link_loss_stop())
            {
                app_ota_error_clear_local(OTA_BLE_DISC);
            }
        }
    }
}

/**
    * @brief  get ota status
    * @return True:is doing ota; False: is not doing ota
    */
bool app_ota_dfu_is_busy(void)
{
    return ota_struct.ota_flag.is_ota_process;
}

/**
    * @brief  link loss handle flag
    * @return True:is doing ota; False: is not doing ota
    */
bool app_ota_link_loss_stop(void)
{
    return ota_struct.ota_flag.is_ota_process;
}

/**
 * @brief erase free bank.
 *
 * @param
 * @return
*/
static void app_ota_erase_temp_bank_header(void)
{
    if (is_ota_support_bank_switch())
    {
        uint32_t ota_temp_addr;
        if (flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0) == get_active_ota_bank_addr())
        {
            ota_temp_addr = flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_1);
        }
        else
        {
            ota_temp_addr = flash_partition_addr_get(PARTITION_FLASH_OTA_BANK_0);
        }

        APP_PRINT_TRACE1("ota_temp_addr:%x", ota_temp_addr);

        fmc_flash_nor_erase(ota_temp_addr, FMC_FLASH_NOR_ERASE_SECTOR);
    }
}

/**
    * @brief  Reset local variables and inactive bank ota header
    * @return void
    */
void app_ota_error_clear_local(uint8_t cause)
{
    if (ota_struct.rws_mode.valid_ret.oth_bud &&
        app_ota_check_ota_mode() == RWS_B2B_CONNECT)
    {
        //app_ota_rws_send_msg(NONE, RWS_OTA_UPDATE_RET, UPDATE_FAIL);
    }

    app_ota_clear_local(cause);
    app_ota_erase_temp_bank_header();
}

/**
    * @brief  check if ota mode
    * @return True:ota mode; False: not in ota mode
    */
bool app_ota_mode_check(void)
{
    return ota_struct.ota_flag.ota_mode;
}


/**
    * @brief  check if ota reset
    * @return True:ota reset; False: not ota reset
    */
bool app_ota_reset_check(void)
{
    return (timer_idx_ota_reset != 0);
}

void app_ota_cback_register(void *cb_func, T_OTA_STAGE ota_stage)
{
    T_OTACbQueueElem *p_item = (T_OTACbQueueElem *)malloc(sizeof(T_OTACbQueueElem));
    if (p_item == NULL)
    {
        APP_PRINT_ERROR0("app_ota_cback_register: queue element malloc fail");
        return;
    }
    p_item->cback = cb_func;
    os_queue_in(&ota_struct.cback_list[ota_stage], p_item);
}
/** End of APP_OTA_Exported_Functions
    * @}
    */

/** @} */ /* End of group APP_OTA_SERVICE */
